uat_chat/Catalogs/уатРаботыПоРемонту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатРаботыПоРемонту</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПлановаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>273</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/InformationRegisters/уатНормочасыРаботПоРемонту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатНормочасыРаботПоРемонту</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоНЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Catalogs/уатРаботыПоРемонту/Ext/ManagerModule.bsl
//Получение цены работы в нормочасах из элемента справочники или справочника нормочасов работ
Функция ПолучитьКоличествоНЧРаботы(МодельТС,РаботаСсылка) Экспорт
	КоличествоНЧ = 0;
	//Сформируем запрос на выборку цены работы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НормочасыРабот.КоличествоНЧ КАК КоличествоНЧ
	|ИЗ
	|	РегистрСведений.уатНормочасыРаботПоРемонту КАК НормочасыРабот
	|ГДЕ
	|	НормочасыРабот.Работа = &ВидРаботы И
	|	НормочасыРабот.МодельТС = &МодельТС";
	Запрос.УстановитьПараметр("ВидРаботы",РаботаСсылка);
	Запрос.УстановитьПараметр("МодельТС",МодельТС);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоНЧ = Выборка.КоличествоНЧ;
	КонецЕсли;
	Возврат КоличествоНЧ;
КонецФункции
